# Pandas String and Regular Expression

## 1.Write a Pandas program to convert all the string values to upper, lower cases in a given pandas series. Also find the length of the string values.

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
s = pd.Series(['X','Y','Z','Aaba','Baca',np.nan,'CABA',None, 'bird','horse','dog'])

In [4]:
s

0         X
1         Y
2         Z
3      Aaba
4      Baca
5       NaN
6      CABA
7      None
8      bird
9     horse
10      dog
dtype: object

In [5]:
s_upper = s.str.upper()

In [6]:
s_upper

0         X
1         Y
2         Z
3      AABA
4      BACA
5       NaN
6      CABA
7      None
8      BIRD
9     HORSE
10      DOG
dtype: object

In [7]:
s_lower = s.str.lower()

In [8]:
s_lower

0         x
1         y
2         z
3      aaba
4      baca
5       NaN
6      caba
7      None
8      bird
9     horse
10      dog
dtype: object

In [9]:
s_length = s.str.len()

In [10]:
s_length

0     1.0
1     1.0
2     1.0
3     4.0
4     4.0
5     NaN
6     4.0
7     NaN
8     4.0
9     5.0
10    3.0
dtype: float64

## 2.Write a Pandas program to remove whitespaces, left sided whitespaces and right spaces sided spaces of the string values of a given pandas series.

In [11]:
color = pd.Series([' Green','Black',' Red','White',' Pink '])

In [12]:
color

0     Green
1     Black
2       Red
3     White
4     Pink
dtype: object

In [13]:
color_whitespaces = color.str.strip()

In [14]:
color_whitespaces

0    Green
1    Black
2      Red
3    White
4     Pink
dtype: object

In [15]:
color_left_white = color.str.lstrip()

In [16]:
color_left_white

0    Green
1    Black
2      Red
3    White
4    Pink
dtype: object

In [17]:
color_right_white = color.str.rstrip()

In [18]:
color_right_white

0     Green
1     Black
2       Red
3     White
4      Pink
dtype: object

In [19]:
print(color.str.strip())

0    Green
1    Black
2      Red
3    White
4     Pink
dtype: object

In [20]:
print(color.str.lstrip())

0    Green
1    Black
2      Red
3    White
4    Pink
dtype: object

In [21]:
print(color.str.rstrip())

0     Green
1     Black
2       Red
3     White
4      Pink
dtype: object

## 3.Write a Pandas program to add leading zeros to the integer column in a pandas series and makes the length of the field to 8 digit.

In [22]:
nums = {'amount':[10,250,3000,40000,500000]}

In [23]:
nums

{'amount': [10, 250, 3000, 40000, 500000]}

In [24]:
df = pd.DataFrame(nums)

In [25]:
df

   amount
0      10
1     250
2    3000
3   40000
4  500000

In [26]:
df.amount = df['amount'].apply(lambda x: '{0:0>8}'.format(x))

In [27]:
df

     amount
0  00000010
1  00000250
2  00003000
3  00040000
4  00500000

## 4.Write a Pandas program to capitalize all the atring values of specified columns of a given DataFrame.

In [28]:
df = pd.DataFrame({"Name":['alberto','gino','ryan','Eesha','syed'],
                  'date_of_birth':['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
                  'age':[18.5,21.2,22.5,22,23]})

In [29]:
df

      Name date_of_birth   age
0  alberto    17/05/2002  18.5
1     gino    16/02/1999  21.2
2     ryan    25/09/1998  22.5
3    Eesha    11/05/2002  22.0
4     syed    15/09/1997  23.0

In [30]:
df.Name = df.Name.str.capitalize()

In [31]:
df

      Name date_of_birth   age
0  Alberto    17/05/2002  18.5
1     Gino    16/02/1999  21.2
2     Ryan    25/09/1998  22.5
3    Eesha    11/05/2002  22.0
4     Syed    15/09/1997  23.0

## 6.Write a Pandas program to find the index of a given substring of a DataFrame column.

In [32]:
df = pd.DataFrame({'name_code':['c001','c002','c022','c2002','c2222'],
                  'date_of_birth':['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
                  'age':[18.5,21.2,22.5,22,23]})

In [33]:
df

  name_code date_of_birth   age
0      c001    12/05/2002  18.5
1      c002    16/02/1999  21.2
2      c022    25/09/1998  22.5
3     c2002    12/02/2022  22.0
4     c2222    15/09/1997  23.0

In [34]:
df['Count'] = list(map(lambda x:x.count('2'),df['name_code']))

In [35]:
df

  name_code date_of_birth   age  Count
0      c001    12/05/2002  18.5      0
1      c002    16/02/1999  21.2      1
2      c022    25/09/1998  22.5      2
3     c2002    12/02/2022  22.0      2
4     c2222    15/09/1997  23.0      4

## 7.Write a Pandas program to find the index of a given substring of a DataFrame column.

In [36]:
df = pd.DataFrame({'name_code':['c001','c002','c022','c2002','c2222'],
                  'date_of_birth':['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
                  'age':[18.5,21.2,22.5,22,23]})

In [37]:
df

  name_code date_of_birth   age
0      c001    12/05/2002  18.5
1      c002    16/02/1999  21.2
2      c022    25/09/1998  22.5
3     c2002    12/02/2022  22.0
4     c2222    15/09/1997  23.0

In [38]:
df['Index'] = list(map(lambda x:x.find('22'),df['name_code']))

In [39]:
df

  name_code date_of_birth   age  Index
0      c001    12/05/2002  18.5     -1
1      c002    16/02/1999  21.2     -1
2      c022    25/09/1998  22.5      2
3     c2002    12/02/2022  22.0     -1
4     c2222    15/09/1997  23.0      1

## 8.Write a Pandas program to find the index of a substring of DataFrame with begining and end position.

In [40]:
df = pd.DataFrame({'name_code':['c001','1000c','b00c2','b2c02','c2222'],
                  'date_of_birth':['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
                  'age':[18.5,21.2,22.5,22,23]})

In [41]:
df

  name_code date_of_birth   age
0      c001    12/05/2002  18.5
1     1000c    16/02/1999  21.2
2     b00c2    25/09/1998  22.5
3     b2c02    12/02/2022  22.0
4     c2222    15/09/1997  23.0

In [42]:
df['Index'] = list(map(lambda x:x.find('c',0,5),df.name_code))

In [43]:
df

  name_code date_of_birth   age  Index
0      c001    12/05/2002  18.5      0
1     1000c    16/02/1999  21.2      4
2     b00c2    25/09/1998  22.5      3
3     b2c02    12/02/2022  22.0      2
4     c2222    15/09/1997  23.0      0

## 9.Write a Pandas program to check alphanumeric values present in a given column of a DataFrame.

In [44]:
df = pd.DataFrame({'name_code':['Company','Company c001','Company 123','1234','Company 12'],
                  'date_of_birth':['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
                  'age':[18.5,21.2,22.5,22,23]})

In [45]:
df

      name_code date_of_birth   age
0       Company    12/05/2002  18.5
1  Company c001    16/02/1999  21.2
2   Company 123    25/09/1998  22.5
3          1234    12/02/2022  22.0
4    Company 12    15/09/1997  23.0

In [46]:
df['alphanumeric'] = list(map(lambda x:x.isalnum(),df.name_code))

In [47]:
df

      name_code date_of_birth   age  alphanumeric
0       Company    12/05/2002  18.5          True
1  Company c001    16/02/1999  21.2         False
2   Company 123    25/09/1998  22.5         False
3          1234    12/02/2022  22.0          True
4    Company 12    15/09/1997  23.0         False

## 10.Write a Pandas program to check whether alphabetic values present in a given column of a DataFrame.

In [48]:
df = pd.DataFrame({'name_code':['Company','Company c001','Company 123','abcd','Company 12'],
                  'date_of_birth':['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
                  'sale_amount':[12348.5,233331.2,22.5,2566552.0,23.0]})

In [49]:
df

      name_code date_of_birth  sale_amount
0       Company    12/05/2002      12348.5
1  Company c001    16/02/1999     233331.2
2   Company 123    25/09/1998         22.5
3          abcd    12/02/2022    2566552.0
4    Company 12    15/09/1997         23.0

In [50]:
df['alpha'] = list(map(lambda x:x.isalpha(),df.name_code))

In [51]:
df

      name_code date_of_birth  sale_amount  alpha
0       Company    12/05/2002      12348.5   True
1  Company c001    16/02/1999     233331.2  False
2   Company 123    25/09/1998         22.5  False
3          abcd    12/02/2022    2566552.0   True
4    Company 12    15/09/1997         23.0  False

## 11.Write a Pandas program to check whether only numeric values present in a given column of DataFrame.

In [52]:
df = pd.DataFrame({'name_code':['Company','Company c001','2055','abcd','123345'],
                  'date_of_birth':['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
                  'sale_amount':[12348.5,233331.2,22.5,2566552.0,23.0]})

In [53]:
df

      name_code date_of_birth  sale_amount
0       Company    12/05/2002      12348.5
1  Company c001    16/02/1999     233331.2
2          2055    25/09/1998         22.5
3          abcd    12/02/2022    2566552.0
4        123345    15/09/1997         23.0

In [54]:
df['digit'] = list(map(lambda x:x.isdigit(),df.name_code))

In [55]:
df

      name_code date_of_birth  sale_amount  digit
0       Company    12/05/2002      12348.5  False
1  Company c001    16/02/1999     233331.2  False
2          2055    25/09/1998         22.5   True
3          abcd    12/02/2022    2566552.0  False
4        123345    15/09/1997         23.0   True

## 12.Write a Pandas program to check whether only lower case or upper case is present in a given column of DataFrame.

In [56]:
df = pd.DataFrame({'company_code':['ABCD','EFGF','hhhh','abcd','EAWQaaa'],'date_of_sale':['12/05/2002','16/02/1999','25/09/1998','12/02/2002','15/09/1997'],
                  'sale_amount':[12348.5,233331.2,22.5,2566552.0,23.0]})

In [57]:
df

  company_code date_of_sale  sale_amount
0         ABCD   12/05/2002      12348.5
1         EFGF   16/02/1999     233331.2
2         hhhh   25/09/1998         22.5
3         abcd   12/02/2002    2566552.0
4      EAWQaaa   15/09/1997         23.0

In [58]:
df['lower'] = df.company_code.str.islower()

In [59]:
df

  company_code date_of_sale  sale_amount  lower
0         ABCD   12/05/2002      12348.5  False
1         EFGF   16/02/1999     233331.2  False
2         hhhh   25/09/1998         22.5   True
3         abcd   12/02/2002    2566552.0   True
4      EAWQaaa   15/09/1997         23.0  False

In [60]:
df['upper'] = df.company_code.str.isupper()

In [61]:
df

  company_code date_of_sale  sale_amount  lower  upper
0         ABCD   12/05/2002      12348.5  False   True
1         EFGF   16/02/1999     233331.2  False   True
2         hhhh   25/09/1998         22.5   True  False
3         abcd   12/02/2002    2566552.0   True  False
4      EAWQaaa   15/09/1997         23.0  False  False

## 13.Write a Pandas program to check whether only proper case or title case is present in a given column of DataFrame.

In [62]:
df = pd.DataFrame({'company_code':['Abcd','EFGF','hhhh','abcd','EAWQaaa'],'date_of_sale':['12/05/2002','16/02/1999','25/09/1998','12/02/2002','15/09/1997'],
                  'sale_amount':[12348.5,233331.2,22.5,2566552.0,23.0]})

In [63]:
df

  company_code date_of_sale  sale_amount
0         Abcd   12/05/2002      12348.5
1         EFGF   16/02/1999     233331.2
2         hhhh   25/09/1998         22.5
3         abcd   12/02/2002    2566552.0
4      EAWQaaa   15/09/1997         23.0

In [64]:
df['proper_title'] = df.company_code.str.istitle()

In [65]:
df

  company_code date_of_sale  sale_amount  proper_title
0         Abcd   12/05/2002      12348.5          True
1         EFGF   16/02/1999     233331.2         False
2         hhhh   25/09/1998         22.5         False
3         abcd   12/02/2002    2566552.0         False
4      EAWQaaa   15/09/1997         23.0         False

## 14.Write a Pandas program to check whether only space is present in a given column of a DataFrame.

In [66]:
df = pd.DataFrame({'company_code':['Abcd',' ','hhhh',' ','EAWQaaa'],'date_of_sale':['12/05/2002','16/02/1999','25/09/1998','12/02/2002','15/09/1997'],
                  'sale_amount':[12348.5,233331.2,22.5,2566552.0,23.0]})

In [67]:
df

  company_code date_of_sale  sale_amount
0         Abcd   12/05/2002      12348.5
1                16/02/1999     233331.2
2         hhhh   25/09/1998         22.5
3                12/02/2002    2566552.0
4      EAWQaaa   15/09/1997         23.0

In [68]:
df['space'] = list(map(lambda x:x.isspace(),df.company_code))

In [69]:
df

  company_code date_of_sale  sale_amount  space
0         Abcd   12/05/2002      12348.5  False
1                16/02/1999     233331.2   True
2         hhhh   25/09/1998         22.5  False
3                12/02/2002    2566552.0   True
4      EAWQaaa   15/09/1997         23.0  False

## 15.Write a Pandas program to get the length of the string present of a given column a DataFrame.

In [70]:
df = pd.DataFrame({'company_code':['Abcd','EFGF','hhhh','abcd','EAWQaaa'],'date_of_sale':['12/05/2002','16/02/1999','25/09/1998','12/02/2002','15/09/1997'],
                  'sale_amount':[12348.5,233331.2,22.5,2566552.0,23.0]})

In [71]:
df

  company_code date_of_sale  sale_amount
0         Abcd   12/05/2002      12348.5
1         EFGF   16/02/1999     233331.2
2         hhhh   25/09/1998         22.5
3         abcd   12/02/2002    2566552.0
4      EAWQaaa   15/09/1997         23.0

In [72]:
df['length'] = df.company_code.str.len()

In [73]:
df

  company_code date_of_sale  sale_amount  length
0         Abcd   12/05/2002      12348.5       4
1         EFGF   16/02/1999     233331.2       4
2         hhhh   25/09/1998         22.5       4
3         abcd   12/02/2002    2566552.0       4
4      EAWQaaa   15/09/1997         23.0       7

## 16.Write a Pandas program to get the length of the integer of a given column in a DataFrame.

In [74]:
df = pd.DataFrame({'company_code':['Abcd','EFGF','skfsalf','sdfslew','safsdf'],
                  'date_of_sale':['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
                  'sale_amount':[12348.5,233331.2,22.5,2566552.0,23.0]})

In [75]:
df

  company_code date_of_sale  sale_amount
0         Abcd   12/05/2002      12348.5
1         EFGF   16/02/1999     233331.2
2      skfsalf   25/09/1998         22.5
3      sdfslew   12/02/2022    2566552.0
4       safsdf   15/09/1997         23.0

In [76]:
df['sale_amount_length'] = df.sale_amount.map(str).apply(len)

In [77]:
df

  company_code date_of_sale  sale_amount  sale_amount_length
0         Abcd   12/05/2002      12348.5                   7
1         EFGF   16/02/1999     233331.2                   8
2      skfsalf   25/09/1998         22.5                   4
3      sdfslew   12/02/2022    2566552.0                   9
4       safsdf   15/09/1997         23.0                   4

## 17.Write a Pandas program to check if a specified column starts with a specified string in a given DataFrame.

In [78]:
df = pd.DataFrame({'company_code':['Abcd','EFGF','zefsalf','sdfslew','zefsdf'],
                  'date_of_sale':['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
                  'sale_amount':[12348.5,233331.2,22.5,2566552.0,23.0]})

In [79]:
df

  company_code date_of_sale  sale_amount
0         Abcd   12/05/2002      12348.5
1         EFGF   16/02/1999     233331.2
2      zefsalf   25/09/1998         22.5
3      sdfslew   12/02/2022    2566552.0
4       zefsdf   15/09/1997         23.0

In [80]:
df['startwith'] = df.company_code.str.startswith('ze')

In [81]:
df

  company_code date_of_sale  sale_amount  startwith
0         Abcd   12/05/2002      12348.5      False
1         EFGF   16/02/1999     233331.2      False
2      zefsalf   25/09/1998         22.5       True
3      sdfslew   12/02/2022    2566552.0      False
4       zefsdf   15/09/1997         23.0       True

## 18.Write a Pandas program to swap the cases of a specified character column in a given DataFrame.

In [82]:
df = pd.DataFrame({'company_code':['Abcd','EFGF','zefsalf','sdfslew','zefsdf'],
                  'date_of_sale':['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
                  'sale_amount':[12348.5,233331.2,22.5,2566552.0,23.0]})

In [83]:
df

  company_code date_of_sale  sale_amount
0         Abcd   12/05/2002      12348.5
1         EFGF   16/02/1999     233331.2
2      zefsalf   25/09/1998         22.5
3      sdfslew   12/02/2022    2566552.0
4       zefsdf   15/09/1997         23.0

In [84]:
df['swap'] = list(map(lambda x:x.swapcase(),df.company_code))

In [85]:
df

  company_code date_of_sale  sale_amount     swap
0         Abcd   12/05/2002      12348.5     aBCD
1         EFGF   16/02/1999     233331.2     efgf
2      zefsalf   25/09/1998         22.5  ZEFSALF
3      sdfslew   12/02/2022    2566552.0  SDFSLEW
4       zefsdf   15/09/1997         23.0   ZEFSDF

## 19.Write a Pandas program to convert a specified character column in upper/lower cases in a given DataFrame.

In [86]:
df = pd.DataFrame({'company_code':['Abcd','EFGF','skfsalf','sdfslew','safsdf'],
                  'date_of_sale':['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
                  'sale_amount':[12348.5,233331.2,22.5,2566552.0,23.0]})

In [87]:
df

  company_code date_of_sale  sale_amount
0         Abcd   12/05/2002      12348.5
1         EFGF   16/02/1999     233331.2
2      skfsalf   25/09/1998         22.5
3      sdfslew   12/02/2022    2566552.0
4       safsdf   15/09/1997         23.0

In [88]:
df['upper'] = list(map(lambda x:x.upper(),df.company_code))

In [89]:
df

  company_code date_of_sale  sale_amount    upper
0         Abcd   12/05/2002      12348.5     ABCD
1         EFGF   16/02/1999     233331.2     EFGF
2      skfsalf   25/09/1998         22.5  SKFSALF
3      sdfslew   12/02/2022    2566552.0  SDFSLEW
4       safsdf   15/09/1997         23.0   SAFSDF

In [90]:
df['lower'] = list(map(lambda x:x.lower(),df.company_code))

In [91]:
df

  company_code date_of_sale  sale_amount    upper    lower
0         Abcd   12/05/2002      12348.5     ABCD     abcd
1         EFGF   16/02/1999     233331.2     EFGF     efgf
2      skfsalf   25/09/1998         22.5  SKFSALF  skfsalf
3      sdfslew   12/02/2022    2566552.0  SDFSLEW  sdfslew
4       safsdf   15/09/1997         23.0   SAFSDF   safsdf

## 20.Write a Pandas program to convert a specified character column in title cases in a given DataFrame.

In [92]:
df = pd.DataFrame({'company_code':['Abcd','EFGF','skfsalf','sdfslew','safsdf'],
                  'date_of_sale':['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
                  'sale_amount':[12348.5,233331.2,22.5,2566552.0,23.0]})

In [93]:
df

  company_code date_of_sale  sale_amount
0         Abcd   12/05/2002      12348.5
1         EFGF   16/02/1999     233331.2
2      skfsalf   25/09/1998         22.5
3      sdfslew   12/02/2022    2566552.0
4       safsdf   15/09/1997         23.0

In [94]:
df['Title'] = list(map(lambda x:x.title(),df.company_code))

In [95]:
df

  company_code date_of_sale  sale_amount    Title
0         Abcd   12/05/2002      12348.5     Abcd
1         EFGF   16/02/1999     233331.2     Efgf
2      skfsalf   25/09/1998         22.5  Skfsalf
3      sdfslew   12/02/2022    2566552.0  Sdfslew
4       safsdf   15/09/1997         23.0   Safsdf

## 21.Write a Pandas program to replace more than one value with other values in a given DataFrame.

In [96]:
df = pd.DataFrame({'company_code':['A','B','C','D','A'],
                  'date_of_sale':['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
                  'sale_amount':[12348.5,233331.2,22.5,2566552.0,23.0]})

In [97]:
df

  company_code date_of_sale  sale_amount
0            A   12/05/2002      12348.5
1            B   16/02/1999     233331.2
2            C   25/09/1998         22.5
3            D   12/02/2022    2566552.0
4            A   15/09/1997         23.0

In [98]:
df = df.replace('A','C')

In [99]:
df

  company_code date_of_sale  sale_amount
0            C   12/05/2002      12348.5
1            B   16/02/1999     233331.2
2            C   25/09/1998         22.5
3            D   12/02/2022    2566552.0
4            C   15/09/1997         23.0

## 22.Write a Pandas program to replace more than one value with other values in a given dataframe.

In [100]:
df = pd.DataFrame({'company_code':['A','B','C','D','A'],
                  'date_of_sale':['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
                  'sale_amount':[12348.5,233331.2,22.5,2566552.0,23.0]})

In [101]:
df

  company_code date_of_sale  sale_amount
0            A   12/05/2002      12348.5
1            B   16/02/1999     233331.2
2            C   25/09/1998         22.5
3            D   12/02/2022    2566552.0
4            A   15/09/1997         23.0

In [106]:
df = df.replace(["A","C"],["X","Y"])

In [107]:
df

  company_code date_of_sale  sale_amount
0            X   12/05/2002      12348.5
1            B   16/02/1999     233331.2
2            Y   25/09/1998         22.5
3            D   12/02/2022    2566552.0
4            X   15/09/1997         23.0

## 23.Write a Pandas program to split a string of a column of a given DataFrame into multiple columns.

In [109]:
df = pd.DataFrame({'name':['Alberto Franco','Gino Ann Mcneil','Ryan Parkes','Eesha Artur Hinton','Syed Wharton'],
                  'date_of_birth':['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/05/1997'],
                  'age':[18.5,21.2,22.5,22,23]})
df

                 name date_of_birth   age
0      Alberto Franco    17/05/2002  18.5
1     Gino Ann Mcneil    16/02/1999  21.2
2         Ryan Parkes    25/09/1998  22.5
3  Eesha Artur Hinton    11/05/2002  22.0
4        Syed Wharton    15/05/1997  23.0

In [110]:
df[['First','Middle','Last']] = df['name'].str.split(" ",expand=True)

In [111]:
df

                 name date_of_birth   age    First   Middle    Last
0      Alberto Franco    17/05/2002  18.5  Alberto   Franco    None
1     Gino Ann Mcneil    16/02/1999  21.2     Gino      Ann  Mcneil
2         Ryan Parkes    25/09/1998  22.5     Ryan   Parkes    None
3  Eesha Artur Hinton    11/05/2002  22.0    Eesha    Artur  Hinton
4        Syed Wharton    15/05/1997  23.0     Syed  Wharton    None

## 24.Write a Pandas program to extract email from a specified column of string type of a given DataFrame.

## 25.Write a Pandas program to extract hash attached word from twitter text from the specified column of a given dataframe.

## 26.Write a Pandas program to extract word mention someone in tweets using @ from the specified column of a given dataframe.

## 27.Write a Pandas program to extract only number from the specified column of a given dataframe.

In [112]:
import re as re

In [113]:
df = pd.DataFrame({'company_code':['c001','c0002','c0003','c0003','c0004'],
                  'address':['7277 Survey Ave.','920 N. Bishop Ave.','9910 Golden Star St.','25 Dunbar St.','17 West Livingston Court']
                  })

In [114]:
df

  company_code                   address
0         c001          7277 Survey Ave.
1        c0002        920 N. Bishop Ave.
2        c0003      9910 Golden Star St.
3        c0003             25 Dunbar St.
4        c0004  17 West Livingston Court

In [116]:
def find_number(text):
    num = re.findall(r'[0-9]+',text)
    return " ".join(num)
df['number'] = df['address'].apply(lambda x: find_number(x))

In [117]:
df

  company_code                   address number
0         c001          7277 Survey Ave.   7277
1        c0002        920 N. Bishop Ave.    920
2        c0003      9910 Golden Star St.   9910
3        c0003             25 Dunbar St.     25
4        c0004  17 West Livingston Court     17

## 28.Write a Pandas program to extract year between 1800 to 2200 from the specified column of a given dataframe.

In [118]:
df = pd.DataFrame({'company_code':['c001','c0002','c0003','c0003','c0004'],
                  'year':['year 1800','year 1700','year 2300','year 1900','year 2200']
                  })

In [119]:
df

  company_code       year
0         c001  year 1800
1        c0002  year 1700
2        c0003  year 2300
3        c0003  year 1900
4        c0004  year 2200

In [120]:
def find_year(text):
    result = re.findall(r'\b18[0-9]{2}|19[0-8][0-9]|199[0-9]|2[01][0-9]{2}|2200\b',text)
    return result
df['year_range'] = df['year'].apply(lambda x: find_year(x))

In [121]:
df

  company_code       year year_range
0         c001  year 1800     [1800]
1        c0002  year 1700         []
2        c0003  year 2300         []
3        c0003  year 1900     [1900]
4        c0004  year 2200     [2200]

## 29.Write a Pandas program to extract only phone number from the specified column of a given dataframe.

## 30.Write a Pandas program to extract only non alphanumeric charactesrs from the specified column of a given dataframe.

In [122]:
df = pd.DataFrame({'company_code':['c0001#','c00@0^2','$c0003','c0003','&c0004'],
                  'year':['year 1800','year 1700','year 2300','year 1900','year 2200']})

In [123]:
df

  company_code       year
0       c0001#  year 1800
1      c00@0^2  year 1700
2       $c0003  year 2300
3        c0003  year 1900
4       &c0004  year 2200

In [125]:
def find_nonalpha(text):
    result = re.findall("[^A-Za-z0-9]",text)
    return result

In [127]:
df['nonalpha'] = df['company_code'].apply(lambda x: find_nonalpha(x))

In [128]:
df

  company_code       year nonalpha
0       c0001#  year 1800      [#]
1      c00@0^2  year 1700   [@, ^]
2       $c0003  year 2300      [$]
3        c0003  year 1900       []
4       &c0004  year 2200      [&]

## 31.Write a Pandas program to extract only punctuations from the specified column of a given dataframe.

In [129]:
df = pd.DataFrame({'company_code':['c0001#','c00@0^2','$c0003','c0003','&c0004'],
                  'year':['year 1800','year 1700','year 2300','year 1900','year 2200']})

In [130]:
df

  company_code       year
0       c0001#  year 1800
1      c00@0^2  year 1700
2       $c0003  year 2300
3        c0003  year 1900
4       &c0004  year 2200

In [133]:
def find_punctuations(text):
    result = re.findall(r'[!"\$%&\'()*+,\-.\/:;=@?\[\\\]^_ ''{|}~]*',text)
    string = "".join(result)
    return list(string)
df['nonalpha'] = df['company_code'].apply(lambda x: find_punctuations(x))

In [134]:
df

  company_code       year nonalpha
0       c0001#  year 1800       []
1      c00@0^2  year 1700   [@, ^]
2       $c0003  year 2300      [$]
3        c0003  year 1900       []
4       &c0004  year 2200      [&]

## 32.Write a Pandas program to remove reprtitive characters from the specified column of a given dataframe.

## 33.Write a Pandas program to extract numbers greater than 940 from the specified column of a given dataframe.

## 34.Write a Pandas program to extract numbers less than 100 from the specified column of a given dataframe.

## 35.Write a Pandas program to check whether two given words present in a specified column of a given dataframe.